//traits 主要特征
//talent 能力,天赋
const traits = [
	//纯洁度判定在virginity
	//名字， 说明， 默认配合值,
	["纤弱", "风一吹就倒体的样子。", 1, ["stamina", 1.2, "lose"]], // 体力消耗 up
	["强壮", "身强力壮肌肉发达。", , ["stamina", 0.8, "lose"]], // 体力消耗 down
	["耐疼", "皮糙肉厚，些许磕碰也不觉得疼。", , ["paAll", 0.8]], //疼痛 down
	["不耐疼", "细皮嫩肉，些许磕碰也会很痛。", , ["paAll", 1.2]], //疼痛 up

	//
	["M体质", "明明很痛，但莫名的有点酸爽。"], //无自觉M倾向, 疼痛能获得少量快感
	["M倾向", "战斗时倾向往前排跑承受伤害。", 10], //有自觉M倾向, 疼痛能获得少量快感
	["A名器", "这个菊穴用起来会很爽。"], //增加攻方的快乐度
	["V名器", "这个秘穴用起来会很爽。"],
	["M名器", "这个嘴用起来会很爽。"],
	["易伤体质", "身上很容易留下痕迹，还不容易消退。"], // 更容易留下伤痕

	//
	["冷静", "无论什么情况都能维持冷静。", , ["fear", 0.8], ["angry", 0.8], ["depress", 0.8]], // 恐惧/愤怒/抑郁 down
	["理智", "无论什么时候都能做出理智的判断。从负面状态中更容易恢复。", 5], // 理智上限up, 非调教状态时各精神数值恢复up
	["不过线", "对什么是都分得很清楚，不会轻易过线。", -10], // 陷落需要更多数值
	["淡漠", "没有世俗的欲望。", , ["arousal", 0.8], ["eager", 0.8], ["satisfy", 1.2]], // 欲情/渴望 down, 满意 up
	["强欲", "小孩才做选择，我全都要！", ["arousal", 1.2], ["eager", 1.2], ["satisfy", 0.8]], // 欲情/渴望 up, 满意down
	["胆大", "无法被恐惧打倒。", 5, ["fear", 0.8]], // 恐惧 down
	["胆小", "容易受到惊吓。", -5, ["fear", 0.8]], // 恐惧 up
	["乐观", "每天都是晴天。", 2, ["depress", 0.8], ["resist", 0.8]], // 抑郁/抵触 down
	["悲观", "每天都是阴天。", -2, ["depress", 1.2], ["resist", 1.2]], // 抑郁/抵触 up
	["傲娇", "才不是为了你呢！"], // 陷落前好感类数值down, 陷落后up
	["乖顺", "哦，好的。", 5, ["surrend", 1.4], ["resist", 0.6]], // 屈服比较容易提升，抵抗down部分指令比较容易执行
	["叛逆", "滚！", -10, ["surrend", 0.6], ["resist", 1.5]], // 抵抗大幅up，屈服down。但特点指令屈服有加成

	//对性的态度， 只能选其中一个
	["性保守", ""], // 清醒时 快感全面down
	["性开放", ""], // 清醒时 快感全面up
	["禁欲", "", -2, ["arousal", 0.2], ["esAll", 1.2]], // 欲望大幅down，快感up，高潮时抵触up
	["放纵", "", 2, ["arousal", 1.8], ["esAll", 0.5]], // 欲望大幅up，快感down
	["洁癖", "", , ["arousal", 0.2], ["resist", 2], ["esAll", 0.9]], // 欲望大幅down, 抵触大幅up, 快感小幅down，高潮时抑郁大幅up
	["性瘾", "无时无刻都想做爱", ["arousal", 2.5]], // 欲望大幅up, 免疫性行为造成的所有负面影响，高潮条翻倍

	["变态", "喜好变态的性行为"], // 作为执行方时解锁指令
	["鬼畜", "喜好鬼畜的性行为"], // 作为执行方时解锁指令

	//
	["高傲", "", -5], //执行某些指令需要更多数值
	["高调", "", 2], //执行某些指令需要较少数值, 影响日常表现
	["低调", ""], //执行某些指令需要更多/较少数值, 影响日常表现
	["高自尊", "", -10, , ["humiliate", 1.2], ["mortify", 1.2], ["resist", 1.5]], //羞耻/抵触 up
	["无节操", "", 10, , ["humilate", 0.6], ["mortify", 0.6], ["resist", 0.8]], //羞耻/抵触 down
	["厚脸皮", "", 2, ["mortify", 0.8], ["favo", 1.1]], //交涉类指令效果up

	//
	["冲动", "", 5, ["sanity", 1.2, "lose"]], //理智消耗 up
	["忍耐", "", , ["paAll", 0.9], ["fear", 0.9], ["arousal", 0.9], ["esAll", 0.9]], //疼痛/恐惧/欲情/快感 小幅down
	["坚韧", "", , ["sanity", 0.8, "lose"], ["paAll", 0.9], ["fear", 0.9], ["arousal", 0.9], ["esAll", 0.9]], //忍耐效果+理智消耗 down
	["不服输", "", 5, ["surrend", 0.8]], //执行某些指令需要较少数值. 屈从down
	["忠诚", ""], // 合意时 屈从up++, 好意up+, 非合意 屈从up, 好意 down
	["贞洁", "", , ["arousal", 0.9]], // 欲情down, 非合意情况 抵触 up++, 好意 down+++
	["放荡", "", 5, ["arousal", 1.5], ["favo", 1.5]], // 欲情up++, 好意up++

	// 陷落系
	["恋慕", "", 10],
	["依恋", "", 20],
	["深爱", "深爱着你", 50],
	["三人行", "同时与你们两人一起交往", 30],

	["服从", "", 10],
	["隶属", "", 20],
	["烙印", "完全属于你", 50],

	["淫乱", "", 10],
	["淫奴", "", 20],
	["淫魔", "", 50],
];
