//经典era模式下的分类设置
D.ComTypes = ["常规", "挑逗", "性交", "肛门", "尿道", "触手", "道具", "SM", "魔法", "情景", "其他"];

D.ComFilterGeneral = ["常规", "挑逗", "魔法", "其他"];
D.ComFilterTrain = ["前戏", "道具", "性交", "尿道", "SM", "鬼畜", "触手", "情景"];

//scEra动作模式下的分类设置
D.ActionTypes = [
	["G", "常规"],
	["M", "目录"],
	["C", "交流"],
	["T", "接触"],
	["R", "逆位"],
	["P", "体位"],
	["I", "道具"],
	["B", "战斗"],
	["Ma", "魔法"],
	["Tx", "触手"],
	["Co", "命令"],
	["O", "其他"],
	["Ex", "固有"],
];

//palam lv的初期値
D.palamLv = [
	0, 200, 600, 1800, 3200, 10000, 30000, 60000, 100000, 150000, 250000, 500000, 1000000, 2500000, 5000000, 10000000,
];

//exp lv的初期値
D.expLv = [0, 3, 10, 30, 100, 200, 400, 600, 800, 1200, 1600, 2000, 2400, 3200, 5000];

//事件模式下默认出口
S.defaultExit = "MainLoop";

//特定情况下的配合度补正。只限经典era模式。
S.ignoreOrder = 20;

//游戏开始时的时间。 顺序为 年， 月，日。
S.date = [4062, 3, 14];
//游戏开始时的具体时间。单位是分钟。
S.time = 1120;

//游戏开始时的进程模式。
//具体值有：event（事件）,train（调教）,reverse（逆调教）,combat（战斗), history（回想)
S.defaultMode = "event";

//物品价格倍率
S.defaultPriceFactor = 2;

//动作模式下各分类的基础配合值。
S.orderConfig = {
	touch: 20,
	sextoy: 30,
	tentacles: 50,
	pose: 50,
};
